Catalogs/Д_СтатьиОборотки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_СтатьиОборотки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазницаЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УЧ_ВидОстаткаПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаСубконто1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаПоПредприятиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УЧ_ВидОстаткаПоСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>УЧ_ВидОстаткаПоСчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебет</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетРазвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитРазвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутыйСубконто1</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутыйСубконто1</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfAccounts/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfAccounts>
		<Properties>
			<Name>Учетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВБалансе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Крахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Catalogs/Д_СтатьиОборотки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьСчета(Команда)
	ПроверитьСчетаСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСчетаСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Учетный.Ссылка
	               |ИЗ
	               |	ПланСчетов.Учетный КАК Учетный
	               |ГДЕ
	               |	Учетный.НеОтражаетсяВБалансе = ЛОЖЬ
	               |	И Учетный.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ Учетный.Ссылка В
	               |				(ВЫБРАТЬ
	               |					СтатьиУчетногоБалансаСчета.Счет
	               |				ИЗ
	               |					Справочник.Д_СтатьиОборотки.Счета КАК СтатьиУчетногоБалансаСчета)
	               |	И Учетный.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Учетный.Код
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	Если ТЗ.Количество() Тогда 
		Сообщить("В балансе не отражены следующие счета: ");
	КонецЕсли;
	
	Для Каждого Строка Из ТЗ Цикл 
		Сообщить(Строка.Ссылка);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРаспределениеСчетовНаСервере()
	
	//проверка для управленческого баланса
	СоответствияВидовСчета = Новый Соответствие;
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.Дебет, Перечисления.УЧ_ВидОстаткаПоСчету.Кредит);
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.Кредит, Перечисления.УЧ_ВидОстаткаПоСчету.Дебет);		
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.ДебетРазвернутый, Перечисления.УЧ_ВидОстаткаПоСчету.КредитРазвернутый);
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.КредитРазвернутый, Перечисления.УЧ_ВидОстаткаПоСчету.ДебетРазвернутый);
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.ДебетСвернутыйСубконто1, Перечисления.УЧ_ВидОстаткаПоСчету.КредитСвернутыйСубконто1);
	СоответствияВидовСчета.Вставить(Перечисления.УЧ_ВидОстаткаПоСчету.КредитСвернутыйСубконто1, Перечисления.УЧ_ВидОстаткаПоСчету.ДебетСвернутыйСубконто1);		
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Дебет, Кредит", "Дебет", "Кредит")); 
	МассивСтруктур.Добавить(Новый Структура("Дебет, Кредит", "ДебетРазвернутый", "КредитРазвернутый")); 
	МассивСтруктур.Добавить(Новый Структура("Дебет, Кредит", "ДебетСвернутыйСубконто1", "КредитСвернутыйСубконто1")); 
	
	Для каждого ТекСтру Из МассивСтруктур Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Д_СтатьиОбороткиСчета.Счет КАК Счет,
		|	Д_СтатьиОбороткиСчета.ВидОстатка КАК ВидОстатка
		|ПОМЕСТИТЬ Дебет
		|ИЗ
		|	Справочник.Д_СтатьиОборотки.Счета КАК Д_СтатьиОбороткиСчета
		|ГДЕ
		|	Д_СтатьиОбороткиСчета.ВидОстатка = ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету." + ТекСтру.Дебет + ")
		|	И Д_СтатьиОбороткиСчета.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Д_СтатьиОборотки.СтатьиУчетногоБаланса))
		|	И Д_СтатьиОбороткиСчета.Ссылка.ЭтоГруппа = ЛОЖЬ
		|	И Д_СтатьиОбороткиСчета.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_СтатьиОбороткиСчета.Счет КАК Счет,
		|	Д_СтатьиОбороткиСчета.ВидОстатка КАК ВидОстатка
		|ПОМЕСТИТЬ Кредит
		|ИЗ
		|	Справочник.Д_СтатьиОборотки.Счета КАК Д_СтатьиОбороткиСчета
		|ГДЕ
		|	Д_СтатьиОбороткиСчета.ВидОстатка = ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету." + ТекСтру.Кредит + ")
		|	И Д_СтатьиОбороткиСчета.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Д_СтатьиОборотки.СтатьиУчетногоБаланса))
		|	И Д_СтатьиОбороткиСчета.Ссылка.ЭтоГруппа = ЛОЖЬ
		|	И Д_СтатьиОбороткиСчета.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Дебет.Счет КАК СчетДт,
		|	Кредит.Счет КАК СчетКт,
		|	КОЛИЧЕСТВО(Дебет.Счет) КАК ПроверкаДт,
		|	КОЛИЧЕСТВО(Кредит.Счет) КАК ПроверкаКт,
		|	Дебет.ВидОстатка КАК ВидОстаткаДт,
		|	Кредит.ВидОстатка КАК ВидОстаткаКт
		|ИЗ
		|	Дебет КАК Дебет
		|		ПОЛНОЕ СОЕДИНЕНИЕ Кредит КАК Кредит
		|		ПО Дебет.Счет = Кредит.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	Дебет.Счет,
		|	Кредит.Счет,
		|	Дебет.ВидОстатка,
		|	Кредит.ВидОстатка";
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПроверкаДт = 0 Тогда
				Сообщить("Ошибка. По счету " + Строка(Выборка.СчетКт) + " не указан вид остатка " + Строка(СоответствияВидовСчета.Получить(Выборка.ВидОстаткаКт)) + "!");
			ИначеЕсли Выборка.ПроверкаДт > 10 Тогда
				Сообщить("Ошибка. По счету " + Строка(Выборка.СчетКт) + " указано более 1 вида остатка " + Строка(СоответствияВидовСчета.Получить(Выборка.ВидОстаткаКт)) + "!");
			КонецЕсли;
			Если Выборка.ПроверкаКт = 0 Тогда
				Сообщить("Ошибка. По счету " + Строка(Выборка.СчетДт) + " не указан вид остатка " + Строка(СоответствияВидовСчета.Получить(Выборка.ВидОстаткаДт)) + "!");
			ИначеЕсли Выборка.ПроверкаКт > 1 Тогда
				Сообщить("Ошибка. По счету " + Строка(Выборка.СчетДт) + " указано более 1 вида остатка " + Строка(СоответствияВидовСчета.Получить(Выборка.ВидОстаткаДт)) + "!");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	//проверка для управленческого баланса на дубли
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д_СтатьиОбороткиСчета.Счет КАК Счет,
	|	Д_СтатьиОбороткиСчета.ВидОстатка КАК ВидОстатка,
	|	СУММА(1) КАК ПроверкаДубля
	|ИЗ
	|	Справочник.Д_СтатьиОборотки.Счета КАК Д_СтатьиОбороткиСчета
	|ГДЕ
	|	Д_СтатьиОбороткиСчета.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Д_СтатьиОборотки.СтатьиУчетногоБаланса))
	|	И Д_СтатьиОбороткиСчета.Ссылка.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Д_СтатьиОбороткиСчета.Счет,
	|	Д_СтатьиОбороткиСчета.ВидОстатка";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Ошибка. По счету " + Строка(Выборка.Счет) + " обнаружен дубль вида остатка " + Строка(Выборка.ВидОстатка) + "!");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаспределениеСчетов(Команда)
	ПроверитьРаспределениеСчетовНаСервере();
КонецПроцедуры
